//#include<stdio.h>
///*
//2016-02-16
//비트Shift연산자 예제 프로그램
//*/
//
//int main(void)
//{
//	// 15 = 00000000 00000000 00000000 000001111
//	int num = 15;
//	
//	// 15 << 1 = 00000000 00000000 00000000 00011110
//	int result1 = num << 1;
//	// 15 << 2 = 00000000 00000000 00000000 00111100
//	int result2 = num << 2;
//	// 15 << 3 = 00000000 00000000 00000000 01111000
//	int result3 = num << 3;
//
//	printf("1칸 이동 결과 : %d\n", result1);
//	printf("1칸 이동 결과 : %d\n", result2);
//	printf("1칸 이동 결과 : %d\n", result3);
//
//	return 0;
//}
